Revit 2024 API
ConnectorElement.CreateDuctConnector Method
Overload List
Name | Description
CreateDuctConnector(Document, DuctSystemType, ConnectorProfileType, Reference)
 Create a new duct ConnectorElement.
CreateDuctConnector(Document, DuctSystemType, ConnectorProfileType, Reference, Edge)
 Create a new duct ConnectorElement.
See Also
ConnectorElement Class
ConnectorElement Members
Autodesk.Revit.DB Namespace